zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/src/stm32mp1xx_hal_rcc_ex.c
  /* Get the SPI1 clock source -----------------------------------------------*/
  PeriphClkInit->Spi1ClockSelection     = __HAL_RCC_GET_SPI1_SOURCE();
  /* Get the SPI23 clock source ----------------------------------------------*/
  PeriphClkInit->Spi23ClockSelection    = __HAL_RCC_GET_SPI23_SOURCE();
  /* Get the SPI45 clock source ----------------------------------------------*/
  PeriphClkInit->Spi45ClockSelection     = __HAL_RCC_GET_SPI45_SOURCE();
  /* Get the SPI6 clock source -----------------------------------------------*/
  PeriphClkInit->Spi6ClockSelection     = __HAL_RCC_GET_SPI6_SOURCE();

  /* Get the USART1 configuration --------------------------------------------*/
  PeriphClkInit->Usart1ClockSelection   = __HAL_RCC_GET_USART1_SOURCE();
  /* Get the UART24 clock source ----------------------------------------------*/
  PeriphClkInit->Uart24ClockSelection    = __HAL_RCC_GET_UART24_SOURCE();
  /* Get the UART35 clock source ---------------------------------------------*/
  PeriphClkInit->Uart35ClockSelection    = __HAL_RCC_GET_UART35_SOURCE();
  /* Get the USART6 clock source ---------------------------------------------*/
  PeriphClkInit->Usart6ClockSelection   = __HAL_RCC_GET_USART6_SOURCE();
  /* Get the UART78 clock source ---------------------------------------------*/
  PeriphClkInit->Uart78ClockSelection    = __HAL_RCC_GET_UART78_SOURCE();

  /* Get the SDMMC12 clock source --------------------------------------------*/
  PeriphClkInit->Sdmmc12ClockSelection   = __HAL_RCC_GET_SDMMC12_SOURCE();
  /* Get the SDMMC3 clock source ---------------------------------------------*/
  PeriphClkInit->Sdmmc3ClockSelection   = __HAL_RCC_GET_SDMMC3_SOURCE();
  /* Get the SDMMC3 clock source ---------------------------------------------*/
  PeriphClkInit->EthClockSelection      = __HAL_RCC_GET_ETH_SOURCE();

  /* Get the QSPI clock source -----------------------------------------------*/
  PeriphClkInit->QspiClockSelection     = __HAL_RCC_GET_QSPI_SOURCE();
  /* Get the FMC clock source ------------------------------------------------*/
  PeriphClkInit->FmcClockSelection      = __HAL_RCC_GET_FMC_SOURCE();
#if defined(FDCAN1)
  /* Get the FDCAN clock source ----------------------------------------------*/
  PeriphClkInit->FdcanClockSelection    = __HAL_RCC_GET_FDCAN_SOURCE();
#endif /*FDCAN1*/
  /* Get the SPDIFRX clock source --------------------------------------------*/
  PeriphClkInit->SpdifrxClockSelection  = __HAL_RCC_GET_SPDIFRX_SOURCE();
  /* Get the CEC clock source ------------------------------------------------*/
  PeriphClkInit->CecClockSelection      = __HAL_RCC_GET_CEC_SOURCE();
  /* Get the USBPHY clock source ---------------------------------------------*/
  PeriphClkInit-> UsbphyClockSelection  = __HAL_RCC_GET_USBPHY_SOURCE();
  /* Get the USBO clock source -----------------------------------------------*/
  PeriphClkInit-> UsboClockSelection    = __HAL_RCC_GET_USBO_SOURCE();
  /* Get the RNG1 clock source -----------------------------------------------*/
  PeriphClkInit->Rng1ClockSelection     = __HAL_RCC_GET_RNG1_SOURCE();
  /* Get the RNG2 clock source -----------------------------------------------*/
  PeriphClkInit->Rng2ClockSelection     = __HAL_RCC_GET_RNG2_SOURCE();
  /* Get the STGEN clock source ----------------------------------------------*/
  PeriphClkInit->StgenClockSelection    = __HAL_RCC_GET_STGEN_SOURCE();
#if defined(DSI)
  /* Get the DSI clock source ------------------------------------------------*/
  PeriphClkInit->DsiClockSelection      = __HAL_RCC_GET_DSI_SOURCE();
#endif /*DSI*/
  /* Get the ADC clock source ------------------------------------------------*/
  PeriphClkInit->AdcClockSelection      = __HAL_RCC_GET_ADC_SOURCE();
  /* Get the RTC clock source ------------------------------------------------*/
  PeriphClkInit->RTCClockSelection      = __HAL_RCC_GET_RTC_SOURCE();

  /* Get the LPTIM1 clock source ---------------------------------------------*/
  PeriphClkInit->Lptim1ClockSelection  = __HAL_RCC_GET_LPTIM1_SOURCE();
  /* Get the LPTIM23 clock source ---------------------------------------------*/
  PeriphClkInit->Lptim23ClockSelection  = __HAL_RCC_GET_LPTIM23_SOURCE();
  /* Get the LPTIM45 clock source ---------------------------------------------*/
  PeriphClkInit->Lptim45ClockSelection  = __HAL_RCC_GET_LPTIM45_SOURCE();

  /* Get the TIM1 Prescaler configuration ------------------------------------*/
  PeriphClkInit->TIMG1PresSelection = __HAL_RCC_GET_TIMG1PRES();
  /* Get the TIM2 Prescaler configuration ------------------------------------*/
  PeriphClkInit->TIMG2PresSelection = __HAL_RCC_GET_TIMG2PRES();
}

/**
  * @brief  Enables the LSE Clock Security System.
  * @note   After reset BDCR register is write-protected and the DBP bit in the
  *         PWR control register 1 (PWR_CR1) has to be set before it can be written.
  * @note   Prior to enable the LSE Clock Security System, LSE oscillator is to be enabled
  *         with HAL_RCC_OscConfig() and the LSE oscillator clock is to be selected as RTC
  *         clock with HAL_RCCEx_PeriphCLKConfig().
  * @retval None
  */
void HAL_RCCEx_EnableLSECSS(void)
{
  /* Set LSECSSON bit */
  SET_BIT(RCC->BDCR, RCC_BDCR_LSECSSON);
}

/**
  * @brief  Disables the LSE Clock Security System.
  * @note   LSE Clock Security System can only be disabled after a LSE failure detection.
  * @note   After reset BDCR register is write-protected and the DBP bit in the
  *         PWR control register 1 (PWR_CR1) has to be set before it can be written.
  * @retval None
  */
void HAL_RCCEx_DisableLSECSS(void)
{
  /* Unset LSECSSON bit */
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSECSSON);
}


/**
  * @brief  Returns the peripheral clock frequency
  * @note   Returns 0 if peripheral clock is unknown
  * @param  PeriphClk: Peripheral clock identifier
  *         This parameter can be a value of :
  *          @ref RCCEx_Periph_Clock_Selection
  *          @ref RCCEx_Periph_One_Clock
  * @retval Frequency in Hz
  */
uint32_t HAL_RCCEx_GetPeriphCLKFreq(uint64_t PeriphClk)
{
  uint32_t frequency = 0, clksource = 0;

