zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/src/stm32mp1xx_hal_rcc_ex.c
        case RCC_USART6CLKSOURCE_CSI:
          frequency = CSI_VALUE;
          break;

        case RCC_USART6CLKSOURCE_HSE:
          frequency = HSE_VALUE;
          break;

        default:
          frequency = 0;
          break;
      }
    }
    break;//RCC_PERIPHCLK_USART6

    case RCC_PERIPHCLK_LPTIM23:
    {
      clksource = __HAL_RCC_GET_LPTIM23_SOURCE();

      switch (clksource)
      {
        case RCC_LPTIM23CLKSOURCE_BCLK:
          frequency = HAL_RCC_GetPCLK3Freq();
          break;

        case RCC_LPTIM23CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_Q_Frequency;
          break;

        case RCC_LPTIM23CLKSOURCE_PER:
          frequency = RCC_GetCKPERFreq();
          break;

        case RCC_LPTIM23CLKSOURCE_LSE:
          frequency = LSE_VALUE;
          break;

        case RCC_LPTIM23CLKSOURCE_LSI:
          frequency = LSI_VALUE;
          break;

        default:
          frequency = 0;
          break;
      }
    }
      break; /* RCC_PERIPHCLK_LPTIM23 */

    case RCC_PERIPHCLK_LPTIM45:
    {
      clksource = __HAL_RCC_GET_LPTIM45_SOURCE();

      switch (clksource)
      {
        case RCC_LPTIM45CLKSOURCE_BCLK:
          frequency = HAL_RCC_GetPCLK3Freq();
          break;

        case RCC_LPTIM45CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_P_Frequency;
          break;

        case RCC_LPTIM45CLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_Q_Frequency;
          break;

        case RCC_LPTIM45CLKSOURCE_LSE:
          frequency = LSE_VALUE;
          break;

        case RCC_LPTIM45CLKSOURCE_LSI:
          frequency = LSI_VALUE;
          break;

        case RCC_LPTIM45CLKSOURCE_PER:
          frequency = RCC_GetCKPERFreq();
          break;

        default:
          frequency = 0;
          break;
      }
    }
      break; /* RCC_PERIPHCLK_LPTIM45 */


    case RCC_PERIPHCLK_SAI4:
    {
      clksource = __HAL_RCC_GET_SAI4_SOURCE();

      switch (clksource)
      {
        case RCC_SAI4CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_Q_Frequency;
          break;

        case RCC_SAI4CLKSOURCE_PLL3_Q:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_Q_Frequency;
          break;

        case RCC_SAI4CLKSOURCE_PLL3_R:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_R_Frequency;
          break;

        case RCC_SAI4CLKSOURCE_I2SCKIN:
          frequency = EXTERNAL_CLOCK_VALUE;
          break;

        case RCC_SAI4CLKSOURCE_PER:
          frequency = RCC_GetCKPERFreq();
          break;

        default:
          frequency = 0;
          break;
      }
    }
    break;//RCC_PERIPHCLK_SAI4


    case RCC_PERIPHCLK_TEMP:
    {
      frequency = LSE_VALUE;
    }
    break;//RCC_PERIPHCLK_TEMP


#if defined(DSI)
    case RCC_PERIPHCLK_DSI:
    {
      clksource = __HAL_RCC_GET_DSI_SOURCE();

      switch (clksource)
      {
        case RCC_DSICLKSOURCE_PHY:
          /* It has no sense to ask for DSIPHY freq. because it is generated
           * by DSI itself, so send back 0 as kernel frequency
           */
          frequency = 0;
          break;

        case RCC_DSICLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_P_Frequency;
          break;
      }
    }
    break;//RCC_PERIPHCLK_DSI
#endif /*DSI*/

    case RCC_PERIPHCLK_LTDC:
    {
      HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
      frequency = pll4_clocks.PLL4_Q_Frequency;
    }
    break;//RCC_PERIPHCLK_LTDC


    case RCC_PERIPHCLK_USBPHY:
    {
      clksource = __HAL_RCC_GET_USBPHY_SOURCE();

      switch (clksource)
      {
        case RCC_USBPHYCLKSOURCE_HSE:
          frequency = HSE_VALUE;
          break;

        case RCC_USBPHYCLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_R_Frequency;
          break;

        case RCC_USBPHYCLKSOURCE_HSE2:
          frequency = (HSE_VALUE / 2);
          break;

        default:
          frequency = 0;
          break;
      }
    }
    break;//RCC_PERIPHCLK_USBPHY


    case RCC_PERIPHCLK_IWDG2:
    {
      frequency = LSI_VALUE;
    }
    break;//RCC_PERIPHCLK_IWDG2


    case RCC_PERIPHCLK_DDRPHYC:
    {
      HAL_RCC_GetPLL2ClockFreq(&pll2_clocks);
      frequency = pll2_clocks.PLL2_R_Frequency;
    }
    break;//RCC_PERIPHCLK_DDRPHYC


    case RCC_PERIPHCLK_RTC:
    {
      clksource = __HAL_RCC_GET_RTC_SOURCE();

      switch (clksource)
      {
        case RCC_RTCCLKSOURCE_OFF:
          frequency = 0;
          break;

        case RCC_RTCCLKSOURCE_LSE:
          frequency = LSE_VALUE;
          break;

        case RCC_RTCCLKSOURCE_LSI:
          frequency = LSI_VALUE;
          break;

        case RCC_RTCCLKSOURCE_HSE_DIV:
          frequency = (HSE_VALUE / __HAL_RCC_GET_RTC_HSEDIV());
          break;
      }
    }
    break;//RCC_PERIPHCLK_RTC


    case RCC_PERIPHCLK_IWDG1:
    {
      frequency = LSI_VALUE;
    }
    break;//RCC_PERIPHCLK_IWDG1


    case RCC_PERIPHCLK_I2C46:
    {
      clksource = __HAL_RCC_GET_I2C46_SOURCE();

      switch (clksource)
      {
        case RCC_I2C46CLKSOURCE_BCLK:
          frequency = HAL_RCC_GetPCLK5Freq();
          break;

        case RCC_I2C46CLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_Q_Frequency;
          break;

        case RCC_I2C46CLKSOURCE_HSI:
          frequency = (HSI_VALUE >> __HAL_RCC_GET_HSI_DIV());
          break;

        case RCC_I2C46CLKSOURCE_CSI:
          frequency = CSI_VALUE;
          break;

        default:
          frequency = 0;
          break;
      }
    }
      break; /* RCC_PERIPHCLK_I2C46 */


    case RCC_PERIPHCLK_SPI6:
    {
      clksource = __HAL_RCC_GET_SPI6_SOURCE();

      switch (clksource)
      {
        case RCC_SPI6CLKSOURCE_BCLK:
          frequency = HAL_RCC_GetPCLK5Freq();
          break;

        case RCC_SPI6CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_Q_Frequency;
          break;

        case RCC_SPI6CLKSOURCE_HSI:
          frequency = (HSI_VALUE >> __HAL_RCC_GET_HSI_DIV());
          break;

        case RCC_SPI6CLKSOURCE_CSI:
          frequency = CSI_VALUE;
          break;

        case RCC_SPI6CLKSOURCE_HSE:
          frequency = HSE_VALUE;
          break;

