zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/src/stm32mp1xx_hal_rcc_ex.c
        case RCC_SPI6CLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_Q_Frequency;
          break;

        default:
          frequency = 0;
          break;
      }
    }
    break;//RCC_PERIPHCLK_SPI6

    case RCC_PERIPHCLK_USART1:
    {
      clksource = __HAL_RCC_GET_USART1_SOURCE();

      switch (clksource)
      {
        case RCC_USART1CLKSOURCE_BCLK:
          frequency = HAL_RCC_GetPCLK5Freq();
          break;

        case RCC_USART1CLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_Q_Frequency;
          break;

        case RCC_USART1CLKSOURCE_HSI:
          frequency = (HSI_VALUE >> __HAL_RCC_GET_HSI_DIV());
          break;

        case RCC_USART1CLKSOURCE_CSI:
          frequency = CSI_VALUE;
          break;

        case RCC_USART1CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_Q_Frequency;
          break;

        case RCC_USART1CLKSOURCE_HSE:
          frequency = HSE_VALUE;
          break;

        default:
          frequency = 0;
          break;
      }
    }
    break;//RCC_PERIPHCLK_USART1


    case RCC_PERIPHCLK_STGEN:
    {
      clksource = __HAL_RCC_GET_STGEN_SOURCE();

      switch (clksource)
      {
        case RCC_STGENCLKSOURCE_HSI:
          frequency = (HSI_VALUE >> __HAL_RCC_GET_HSI_DIV());
          break;

        case RCC_STGENCLKSOURCE_HSE:
          frequency = HSE_VALUE;
          break;

        default:
          frequency = 0;
          break;
      }
    }
    break;//RCC_PERIPHCLK_STGEN


    case RCC_PERIPHCLK_QSPI:
    {
      clksource = __HAL_RCC_GET_QSPI_SOURCE();

      switch (clksource)
      {
        case RCC_QSPICLKSOURCE_BCLK:
          frequency = HAL_RCC_GetACLKFreq();
          break;

        case RCC_QSPICLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_R_Frequency;
          break;

        case RCC_QSPICLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_P_Frequency;
          break;

        case RCC_QSPICLKSOURCE_PER:
          frequency = RCC_GetCKPERFreq();
          break;

        default:
          frequency = 0;
          break;
      }
    }
    break;//RCC_PERIPHCLK_QSPI


    case RCC_PERIPHCLK_ETH:
    {
      clksource = __HAL_RCC_GET_ETH_SOURCE();

      switch (clksource)
      {
        case RCC_ETHCLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_P_Frequency;
          break;

        case RCC_ETHCLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_Q_Frequency;
          break;

        default:
          frequency = 0;
          break;
      }
    }
    break;//RCC_PERIPHCLK_ETH


    case RCC_PERIPHCLK_FMC:
    {
      clksource = __HAL_RCC_GET_FMC_SOURCE();

      switch (clksource)
      {
        case RCC_FMCCLKSOURCE_BCLK:
          frequency = HAL_RCC_GetACLKFreq();
          break;

        case RCC_FMCCLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_R_Frequency;
          break;

        case RCC_FMCCLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_P_Frequency;
          break;

        case RCC_FMCCLKSOURCE_PER:
          frequency = RCC_GetCKPERFreq();
          break;

      }
    }
    break;//RCC_PERIPHCLK_FMC


    case RCC_PERIPHCLK_GPU:
    {
      HAL_RCC_GetPLL2ClockFreq(&pll2_clocks);
      frequency = pll2_clocks.PLL2_Q_Frequency;
    }
    break;//RCC_PERIPHCLK_GPU


    case RCC_PERIPHCLK_USBO:
    {
      clksource = __HAL_RCC_GET_USBO_SOURCE();

      switch (clksource)
      {
        case RCC_USBOCLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_R_Frequency;
          break;

        case RCC_USBOCLKSOURCE_PHY:
          frequency = USB_PHY_VALUE;
          break;
      }
    }
    break;//RCC_PERIPHCLK_USBO


    case RCC_PERIPHCLK_SDMMC3:
    {
      clksource = __HAL_RCC_GET_SDMMC3_SOURCE();

      switch (clksource)
      {
        case RCC_SDMMC3CLKSOURCE_BCLK:
          frequency = HAL_RCC_GetHCLK2Freq();
          break;

        case RCC_SDMMC3CLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_R_Frequency;
          break;

        case RCC_SDMMC3CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_P_Frequency;
          break;

        case RCC_SDMMC3CLKSOURCE_HSI:
          frequency = (HSI_VALUE >> __HAL_RCC_GET_HSI_DIV());

        default:
          frequency = 0;
          break;
      }
    }
    break;//RCC_PERIPHCLK_SDMMC3


    case RCC_PERIPHCLK_ADC:
    {
      clksource = __HAL_RCC_GET_ADC_SOURCE();

      switch (clksource)
      {
        case RCC_ADCCLKSOURCE_PLL4:
            HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
            frequency = pll4_clocks.PLL4_R_Frequency;
          break;

        case RCC_ADCCLKSOURCE_PER:
          frequency = RCC_GetCKPERFreq();
          break;

        case RCC_ADCCLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_Q_Frequency;

        default:
          frequency = 0;
          break;
      }
    }
      break; /* RCC_PERIPHCLK_ADC */


    case RCC_PERIPHCLK_RNG2:
    {
      clksource = __HAL_RCC_GET_RNG2_SOURCE();

      switch (clksource)
      {
        case RCC_RNG2CLKSOURCE_CSI:
          frequency = CSI_VALUE;
          break;

        case RCC_RNG2CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_R_Frequency;
          break;

        case RCC_RNG2CLKSOURCE_LSE:
          frequency = LSE_VALUE;
          break;

        case RCC_RNG2CLKSOURCE_LSI:
          frequency = LSI_VALUE;
          break;
      }
    }
    break;//RCC_PERIPHCLK_RNG2


    case RCC_PERIPHCLK_RNG1:
    {
      clksource = __HAL_RCC_GET_RNG1_SOURCE();

      switch (clksource)
      {
        case RCC_RNG1CLKSOURCE_CSI:
          frequency = CSI_VALUE;
          break;

        case RCC_RNG1CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_R_Frequency;
          break;

        case RCC_RNG1CLKSOURCE_LSE:
          frequency = LSE_VALUE;
          break;

        case RCC_RNG1CLKSOURCE_LSI:
          frequency = LSI_VALUE;
          break;
      }
    }
    break;//RCC_PERIPHCLK_RNG1

    case RCC_PERIPHCLK_SDMMC12:
    {
      clksource = __HAL_RCC_GET_SDMMC12_SOURCE();

      switch (clksource)
      {
        case RCC_SDMMC12CLKSOURCE_BCLK:
          frequency = HAL_RCC_GetHCLK6Freq();
          break;

        case RCC_SDMMC12CLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_R_Frequency;
          break;

        case RCC_SDMMC12CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_P_Frequency;
          break;

